import  pandas as pd
import connect_db as db

ll = ((1, '阿莫西林', '28', '消炎', 1.0, 28.0), (1, '铁头功', '28', '铁头', 1.0, 28.0), (2, '阿莫西林', '28', '消炎', 3.0, 84.0), (2, '如来神掌', '23', '如来', 1.0, 23.0), (2, '掏你鸡鸡', '24', '鸡鸡', 1.0, 24.0), (2, '铁头功', '28', '铁头', 1.0, 28.0), (2, '蛤蟆功', '21', '蛤蟆', 3.0, 63.0), (3, '阿莫西林', '28', '消炎', 1.0, 28.0))
s = set()
for i in ll:
    s.add(i[0])

list_all = []
for num in s:
    list_1 = []
    for i in ll:
        if i[0] == num:
            list_1.append(i[1:])
    my_tuple = (num,list_1)
    list_all.append(my_tuple)
print(list_all)


# aa = [('1',[('阿莫西林', '28', '消炎', 1.0, 28.0), ('铁头功', '28', '铁头', 1.0, 28.0)])]
for i,j in list_all:
    print(i,j)

ii = ((1, '阿莫西林', '28', '消炎', '2022-10-23', 1.0, 28.0), (1, '铁头功', '28', '铁头', '2022-10-23', 1.0, 28.0), (2, '阿莫西林', '28', '消炎', '2022-10-23', 3.0, 84.0), (2, '如来神掌', '23', '如来', '2022-10-23', 1.0, 23.0), (2, '掏你鸡鸡', '24', '鸡鸡', '2022-10-23', 1.0, 24.0), (2, '铁头功', '28', '铁头', '2022-10-23', 1.0, 28.0), (2, '蛤蟆功', '21', '蛤蟆', '2022-10-23', 3.0, 63.0), (3, '阿莫西林', '28', '消炎', '2022-10-23', 1.0, 28.0))

